group-reports/shahriar-1-2-tests/results/disk-throughput-tuning-protocol-A-sndbuf-2M/test-3.txt
read-randomly-test-job: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=16
...
fio-3.7
Starting 16 processes
read-randomly-test-job: Laying out IO file (1 file / 10240MiB)

read-randomly-test-job: (groupid=0, jobs=16): err= 0: pid=22710: Sun Jul  9 07:58:13 2023
   read: IOPS=200, BW=1601KiB/s (1639kB/s)(940MiB/601258msec)
    slat (usec): min=5, max=172764, avg=103.14, stdev=586.20
    clat (msec): min=10, max=2515, avg=1278.80, stdev=52.12
     lat (msec): min=10, max=2515, avg=1278.90, stdev=52.11
    clat percentiles (msec):
     |  1.00th=[ 1267],  5.00th=[ 1267], 10.00th=[ 1267], 20.00th=[ 1267],
     | 30.00th=[ 1284], 40.00th=[ 1284], 50.00th=[ 1284], 60.00th=[ 1284],
     | 70.00th=[ 1284], 80.00th=[ 1284], 90.00th=[ 1284], 95.00th=[ 1301],
     | 99.00th=[ 1318], 99.50th=[ 1334], 99.90th=[ 1737], 99.95th=[ 2039],
     | 99.99th=[ 2366]
   bw (  KiB/s): min=   14, max=  704, per=7.38%, avg=118.13, stdev=75.53, samples=16206
   iops        : min=    1, max=   88, avg=14.45, stdev= 9.45, samples=16206
  lat (msec)   : 20=0.01%, 50=0.01%, 100=0.01%, 250=0.06%, 500=0.04%
  lat (msec)   : 750=0.04%, 1000=0.05%
  cpu          : usr=0.06%, sys=0.14%, ctx=118519, majf=0, minf=641
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=99.8%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=120319,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=1601KiB/s (1639kB/s), 1601KiB/s-1601KiB/s (1639kB/s-1639kB/s), io=940MiB (986MB), run=601258-601258msec

Disk stats (read/write):
    drbd1: ios=120319/6, merge=0/0, ticks=153726595/398, in_queue=153726993, util=99.33%, aggrios=120319/9, aggrmerge=0/0, aggrticks=153731159/397, aggrin_queue=153731556, aggrutil=99.32%
    dm-0: ios=120319/9, merge=0/0, ticks=153731159/397, in_queue=153731556, util=99.32%, aggrios=120319/9, aggrmerge=0/0, aggrticks=153734730/94, aggrin_queue=153674669, aggrutil=99.32%
  vdb: ios=120319/9, merge=0/0, ticks=153734730/94, in_queue=153674669, util=99.32%